# BalancedLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..BalancedLoad Property
ElectricalSystem Class See Also
---
Reports whether the BalancedLoad is on or off.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool BalancedLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BalancedLoad As Boolean
	Get
```

Visual C++
---
```text
public:
property bool BalancedLoad {
	bool get ();
}
```

# Remarks
This property is used to retrieve the BalancedLoad value of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This property only available when System Type is Power! |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace